1) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:10    [M] Plus
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1b84e0cf6eba87b87645084234fefc8c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
 {
     public function adds(int $x, int $y)
     {
-        return $x + $y;
+        return $x - $y;
     }
     public function subtracts(int $x, int $y)
     {
-        return $x + $y;
PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

....                                                                4 / 4 (100%)

Time: 21 ms, Memory: 4.00MB

OK (4 tests, 4 assertions)

2) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:15    [M] Plus
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.510ea52bb271bcdf1c7544db4b23c8d7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     }
     public function subtracts(int $x, int $y)
     {
-        return $x + $y;
+        return $x - $y;
     }
     public function inArray($arr, $needle)
     {

PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

....                                                                4 / 4 (100%)

Time: 18 ms, Memory: 4.00MB

OK (4 tests, 4 assertions)

1) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:8    [M] PublicVisibility
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4203ad0241d3b4270b0bf35466dbe1e6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
 
 final class Calculator
 {
-    public function adds(int $x, int $y)
+    protected function adds(int $x, int $y)
     {
         return $x + $y;
     }
     public function subtracts(int $x, int $y)
PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

E

Time: 17 ms, Memory: 4.00MB

There was 1 error:

1) CalculatorTest::test_adds
Error: Call to protected method Ex1\Calculator::adds() from context 'CalculatorTest'

/home/slash3b/Projects/mutation_testing_presentation/ex1/tests/CalculatorTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

2) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:13    [M] PublicVisibility
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7c630716dea024dd003003cfe142a2a9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
         return $x + $y;
     }
-    public function subtracts(int $x, int $y)
+    protected function subtracts(int $x, int $y)
     {
-        return $x + $y;
+        return $x - $y;
     }
PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

.E

Time: 17 ms, Memory: 4.00MB

There was 1 error:

1) CalculatorTest::test_subtracts
Error: Call to protected method Ex1\Calculator::subtracts() from context 'CalculatorTest'

/home/slash3b/Projects/mutation_testing_presentation/ex1/tests/CalculatorTest.php:20

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

3) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:20    [M] Foreach_
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.df863767a14f56ea541290fa872a89c6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     }
     public function subtracts(int $x, int $y)
     {
-        return $x + $y;
+        return $x - $y;
     }
     public function inArray($arr, $needle)
     {
-        foreach ($arr as $elem) {
PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

..E

Time: 18 ms, Memory: 4.00MB

There was 1 error:

1) CalculatorTest::test_in_array
Undefined variable: result

/home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:24
/home/slash3b/Projects/mutation_testing_presentation/ex1/tests/CalculatorTest.php:27

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

4) /home/slash3b/Projects/mutation_testing_presentation/ex1/src/Calculator.php:18    [M] PublicVisibility
exec /usr/bin/php -c /tmp/infectionf2h6Lm  /home/slash3b/Projects/mutation_testing_presentation/ex1/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0c1b6b6d241fb5f98cc8771b4fcdcf12.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     }
     public function subtracts(int $x, int $y)
     {
-        return $x + $y;
+        return $x - $y;
     }
-    public function inArray($arr, $needle)
+    protected function inArray($arr, $needle)
     {
PHPUnit 7.2.6 by Sebastian Bergmann and contributors.

..E

Time: 18 ms, Memory: 4.00MB

There was 1 error:

1) CalculatorTest::test_in_array
Error: Call to protected method Ex1\Calculator::inArray() from context 'CalculatorTest'

/home/slash3b/Projects/mutation_testing_presentation/ex1/tests/CalculatorTest.php:27

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.
